InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕдиногоНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентЕСВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаПлательщикаЕдиногоНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыПлательщиковЕдиногоНалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДоходаЕНПерваяГруппа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДоходаЕНВтораяГруппа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДоходаЕНТретьяГруппа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДоходаЕНЧетвертаяГруппа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДоходаЕНПятаяГруппа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемДоходаЕНШестаяГруппа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СистемыНалогообложенияОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновитьИспользованиеОСНО() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СистемыНалогообложенияОрганизаций.СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
	|ГДЕ
	|	СистемыНалогообложенияОрганизаций.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)";
	ИспользуетсяОСНО = НЕ Запрос.Выполнить().Пустой();
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ФункциональнаяОпцияИспользуетсяОСНО.Установить(ИспользуетсяОСНО);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновитьИспользованиеРозничнойПродажиАлкоголя() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СистемыНалогообложенияОрганизаций.СистемаНалогообложения
	|ИЗ
	|	РегистрСведений.СистемыНалогообложенияОрганизаций КАК СистемыНалогообложенияОрганизаций
	|ГДЕ
	|	СистемыНалогообложенияОрганизаций.РозничнаяПродажаАлкоголя";
	ИспользуетсяРозничнаяПродажаАлкоголя = НЕ Запрос.Выполнить().Пустой();
	
	Если ИспользуетсяРозничнаяПродажаАлкоголя Тогда
		УстановитьПривилегированныйРежим(Истина);
		Если Не ПолучитьФункциональнуюОпцию("УчетРозничныхПродаж") Тогда
			Константы.ФункциональнаяОпцияУчетРозничныхПродаж.Установить(Истина);
		КонецЕсли;
		
		Если Не Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Получить() Тогда
			Константы.ВестиСведенияДляДекларацийПоАлкогольнойПродукции.Установить(Истина);
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьСистемуНалогообложенияОрганизации(Организация, Знач Дата) экспорт
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Новый Структура("ПлательщикУСН, ПлательщикЕНВД, ПрименяетсяПатент",Ложь, Ложь, Ложь);;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат РегистрыСведений.СистемыНалогообложенияОрганизаций.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	
КонецФункции

#КонецЕсли
